[
  {
    "id": 1,
    "chef_picture": "https://img.freepik.com/free-photo/happy-cook-smelling-salad-with-meat-plate_23-2148040176.jpg?size=626&ext=jpg&ga=GA1.1.1712736525.1683002556&semt=ais",
    "chef_name": "Maria Garcia",
    "country_name": "Mexico",
    "years_of_experience": 10,
    "num_recipes": 30,
    "likes": 800,
    "bio": "Chef Maria Garcia is a renowned Mexican chef with over 10 years of experience in the culinary industry. Her passion for authentic Mexican flavors and ingredients is reflected in her delicious recipes.",
    "recipes": [
      {
        "id": 11,
        "recipe_name": "Chicken Enchiladas",
        "ingredients": [
          "2 cups cooked and shredded chicken",
          "8-10 corn tortillas",
          "1 cup enchilada sauce",
          "1 cup shredded cheddar cheese",
          "1/4 cup chopped cilantro"
        ],
        "cooking_method": "1. Preheat oven to 375°F. \n2. Spread 1/4 cup of enchilada sauce on the bottom of a baking dish. \n3. Dip each tortilla in the remaining enchilada sauce and fill with shredded chicken. \n4. Roll up each tortilla and place in baking dish seam-side down. \n5. Pour remaining enchilada sauce over the enchiladas and sprinkle with shredded cheese. \n6. Bake for 20-25 minutes until cheese is melted and bubbly. \n7. Garnish with chopped cilantro and serve hot.",
        "rating": 4.5
      },
      {
        "id": 12,
        "recipe_name": "Guacamole",
        "ingredients": [
          "3 ripe avocados",
          "1/4 cup chopped red onion",
          "1/4 cup chopped fresh cilantro",
          "2 tbsp lime juice",
          "1 jalapeno pepper, seeded and minced"
        ],
        "cooking_method": "1. Cut avocados in half, remove the pit and scoop out the flesh into a bowl. \n2. Add red onion, cilantro, lime juice and jalapeno pepper to the bowl. \n3. Mash everything together with a fork until desired consistency is reached. \n4. Serve immediately with tortilla chips or as a condiment for tacos, burritos, etc.",
        "rating": 4.7
      },
      {
        "id": 13,
        "recipe_name": "Pico de Gallo",
        "ingredients": [
          "4 Roma tomatoes, diced",
          "1/4 cup finely diced red onion",
          "1/4 cup chopped fresh cilantro",
          "1 jalapeno pepper, seeded and minced",
          "2 tbsp lime juice"
        ],
        "cooking_method": "1. In a bowl, mix together diced tomatoes, red onion, cilantro and jalapeno pepper. \n2. Drizzle lime juice over the mixture and toss everything together. \n3. Refrigerate for at least 30 minutes before serving to allow flavors to meld together. \n4. Serve with tortilla chips or as a condiment for tacos, burritos, etc.",
        "rating": 4.3
      }
    ]
  },
  {
    "id": 2,
    "chef_picture": "https://img.freepik.com/free-photo/happy-young-cook-uniform-holding-salad_171337-5342.jpg?size=626&ext=jpg&ga=GA1.1.1712736525.1683002556&semt=ais",
    "chef_name": "Juan Martinez",
    "country_name": "Mexico",
    "years_of_experience": 8,
    "num_recipes": 25,
    "likes": 700,
    "bio": "Chef Juan Martinez is a talented Mexican chef who has been cooking for over 8 years. He specializes in creating traditional and innovative Mexican dishes that are bursting with flavor.",
    "recipes": [
      {
        "id": 21,
        "recipe_name": "Taco Salad",
        "ingredients": [
          "1 lb. ground beef",
          "1/2 onion, diced",
          "1 can black beans, rinsed and drained",
          "1 can corn, drained",
          "1 large tomato, chopped",
          "1 avocado, diced",
          "1/4 cup cilantro, chopped",
          "1 package taco seasoning mix",
          "12 oz. Tortilla chips, crushed",
          "3 cups shredded lettuce",
          "1 cup shredded cheddar cheese",
          "1/2 cup salsa",
          "1/2 cup sour cream"
        ],
        "cooking_method": "1. In a large skillet, cook the ground beef and onion over medium heat until browned. Drain any excess fat. \n2. Add the black beans, corn, tomato, avocado, and cilantro to the skillet and stir to combine. Heat through. \n3. Add the taco seasoning mix and stir to combine. \n4. In a large bowl, toss together the crushed tortilla chips and shredded lettuce. \n5. Spoon the beef mixture over the lettuce mixture. Top with shredded cheese, salsa, and sour cream. \n6. Serve immediately.",
        "rating": 4.2
      },
      {
        "id": 22,
        "recipe_name": "Chiles Rellenos",
        "ingredients": [
          "6 poblano peppers",
          "1 lb. ground pork",
          "1/2 onion, chopped",
          "2 cloves garlic, minced",
          "1/2 cup long-grain white rice",
          "1/2 cup diced tomatoes",
          "1/2 cup corn",
          "1 tsp. cumin",
          "1 tsp. salt",
          "1/2 tsp. black pepper",
          "1/2 cup shredded cheddar cheese",
          "1/4 cup chopped fresh cilantro"
        ],
        "cooking_method": "1. Preheat oven to 350°F. Lightly oil a baking dish. \n2. Roast the poblano peppers over an open flame or under the broiler until the skin is charred on all sides. Place the peppers in a paper bag and let them cool for 10 minutes. Peel off the skin. \n3. In a skillet, cook the ground pork, onion, and garlic over medium-high heat until the pork is cooked through. Drain any excess fat. \n4. Stir in the rice, tomatoes, corn, cumin, salt, and black pepper. Cook for 5 minutes, stirring occasionally. \n5. Stuff the poblano peppers with the pork mixture. Place them in the prepared baking dish. \n6. Sprinkle the cheese on top of the peppers. \n7. Bake for 15-20 minutes, until the cheese is melted and bubbly. \n8. Garnish with cilantro and serve hot.",
        "rating": 4.6
      },
      {
        "id": 23,
        "recipe_name": "Mole Poblano",
        "ingredients": [
          "3 dried ancho chiles, stemmed and seeded",
          "3 dried pasilla chiles, stemmed and seeded",
          "2 cups chicken broth",
          "1/2 cup raisins",
          "1/4 cup slivered almonds",
          "3 tbsp. sesame seeds",
          "1/4 cup vegetable oil",
          "1 onion, chopped",
          "3 cloves garlic, minced",
          "1 tsp. ground cinnamon",
          "1/2 tsp. ground allspice",
          "1/4 tsp. ground cloves",
          "1/2 oz. dark chocolate, chopped",
          "2 tbsp. sugar",
          "1 tbsp. red wine vinegar",
          "1 turkey breast (about 2 1/2 lbs.), cooked and shredded"
        ],
        "cooking_method": "1. Pre heat oven to 350°F. \n2. In a large skillet, toast the ancho chiles and pasilla chiles over medium heat until fragrant, about 2 minutes per side. \n3. In a blender, combine the toasted chiles, chicken broth, raisins, almonds, and sesame seeds. Puree until smooth. \n4. In the same skillet, heat the vegetable oil over medium-high heat. Add the onion and garlic and cook until softened, about 5 minutes. \n5. Add the cinnamon, allspice, and cloves and cook for 1 minute. \n6. Add the pureed chile mixture to the skillet and bring to a boil. Reduce heat to low and simmer for 20-30 minutes, stirring occasionally. \n7. Stir in the dark chocolate, sugar, and vinegar and cook until the chocolate is melted and everything is well combined, about 5 minutes. \n8. Add the shredded turkey to the skillet and stir to coat with the mole sauce. \n9. Transfer the turkey and sauce to a baking dish and bake for 25-30 minutes, until heated through. \n10. Serve hot.",
        "rating": 4.8
      }
    ]
  },
  {
    "id": 3,
    "chef_picture": "https://img.freepik.com/free-photo/male-chef-kitchen-cooking_23-2148934673.jpg?size=626&ext=jpg&ga=GA1.1.1712736525.1683002556&semt=ais",
    "chef_name": "Pedro Sanchez",
    "country_name": "Mexico",
    "years_of_experience": 12,
    "num_recipes": 35,
    "likes": 1200,
    "bio": "Chef Pedro Sanchez is a veteran of the culinary world, with over 12 years of experience crafting delicious, authentic Mexican dishes. His passion for cooking began at an early age and has only grown stronger over time.",
    "recipes": [
      {
        "id": 31,
        "recipe_name": "Tamales",
        "ingredients": [
          "2 cups masa harina",
          "1 tsp. baking powder",
          "1/2 tsp. salt",
          "1/2 cup vegetable shortening",
          "1 1/2 cups chicken broth",
          "1 lb. pork shoulder, cooked and shredded",
          "1 can (16 oz.) tomato sauce",
          "1 tbsp. chili powder",
          "1 tsp. ground cumin"
        ],
        "cooking_method": "1. In a large bowl, combine the masa harina, baking powder, and salt. \n2. In another bowl, cream together the vegetable shortening until light and fluffy. Gradually add the masa mixture, mixing well between additions. \n3. Slowly stir in the chicken broth, mixing until a soft dough forms. \n4. Rinse corn husks in hot water for 15 minutes, or until they become pliable. \n5. Spread about 2 tablespoons of the masa mixture onto each corn husk. Add a spoonful of shredded pork to the center of each husk. \n6. Roll up the tamale and fold the bottom end under. \n7. In a large pot, steam the tamales for 1 hour. \n8. In another pot, combine the tomato sauce, chili powder, and cumin. Simmer for 10 minutes. \n9. To serve, spoon some of the sauce over the tamales.",
        "rating": 4.9
      },
      {
        "id": 32,
        "recipe_name": "Churros",
        "ingredients": [
          "1 cup water",
          "2 tbsp. sugar",
          "1/2 tsp. salt",
          "2 tbsp. vegetable oil",
          "1 cup all-purpose flour",
          "2 quarts oil for frying",
          "1/2 cup sugar",
          "1 tsp. ground cinnamon"
        ],
        "cooking_method": "1. In a saucepan, combine the water, 2 tablespoons of sugar, salt, and 2 tablespoons of vegetable oil. Bring to a boil over high heat. \n2. Remove from heat and stir in the flour until it forms a ball. \n3. Heat the oil for frying in a deep-fryer or deep skillet to 375°F. \n4. Pipe strips of dough into the hot oil using a pastry bag. Fry until golden brown. Drain on paper towels. \n5. Combine the remaining 1/2 cup of sugar and 1 teaspoon of cinnamon. Roll the churros in the cinnamon sugar mixture.",
        "rating": 4.2
      },
      {
        "id": 33,
        "recipe_name": "Pozole Rojo",
        "ingredients": [
          "1 onion, chopped",
          "2 cloves garlic, minced",
          "1 tbsp. vegetable oil",
          "2 lbs. pork shoulder, cut into chunks",
          "6 cups chicken broth",
          "3 dried ancho chiles, stemmed and seeded",
          "3 dried guajillo chiles, stemmed and seeded",
          "1 can (28 oz.) hominy, drained",
          "1 tbsp. oregano",
          "1 tsp. ground cumin",
          "Salt and pepper to taste",
          "Lime wedges, sliced radishes, and shredded cabbage for serving"
        ],
        "cooking_method": "1. In a large pot, sauté the onion and garlic in the vegetable oil until softened. \n2. Add the pork and brown on all sides. \n3. Pour in the chicken broth and bring to a boil. Reduce heat and simmer for 1 hour. \n4. While the pork is cooking, toast the ancho and guajillo chiles in a dry skillet over medium-high heat until fragrant, about 1-2 minutes per side. \n5. Place the toasted chiles in a bowl and cover with hot water. Let them soak for 10-15 minutes, until softened. \n6. In a blender, puree the soaked chiles until smooth. Strain the puree into the pot with the pork and broth. \n7. Add the hominy, oregano, and cumin to the pot. Simmer for another 30 minutes, until the pork is tender and the flavors have melded together. \n8. Season with salt and pepper to taste. \n9. Serve hot with lime wedges, sliced radishes, and shredded cabbage.",
        "rating": 4.7
      }
    ]
  },
  {
    "id": 4,
    "chef_picture": "https://img.freepik.com/free-photo/person-cooking-japanese-food_23-2149366815.jpg?size=626&ext=jpg&ga=GA1.1.1712736525.1683002556&semt=ais",
    "chef_name": "Ana Rodriguez",
    "country_name": "Mexico",
    "years_of_experience": 10,
    "num_recipes": 28,
    "likes": 900,
    "bio": "Chef Ana Rodriguez is a talented Mexican chef who has been cooking for over 10 years. She specializes in creating traditional and modern Mexican dishes that showcase the flavors and ingredients of her country.",
    "recipes": [
      {
        "id": 41,
        "recipe_name": "Enchiladas Verdes",
        "ingredients": [
          "12 corn tortillas",
          "2 cups cooked chicken, shredded",
          "1/2 onion, chopped",
          "1 can (4 oz.) chopped green chilies",
          "1 cup sour cream",
          "2 cups shredded Monterey Jack cheese",
          "1 can (28 oz.) green enchilada sauce",
          "1/4 cup chopped fresh cilantro"
        ],
        "cooking_method": "1. Preheat oven to 350°F. \n2. In a large bowl, combine the chicken, onion, green chilies, and sour cream. Stir in 1 cup of the shredded cheese. \n3. Spoon some of the enchilada sauce into a 9x13 inch baking dish. \n4. Dip each tortilla into the remaining enchilada sauce to coat. Spoon about 1/4 cup of the chicken mixture onto each tortilla. Roll up the tortillas and place them seam-side down in the baking dish. \n5. Pour the remaining enchilada sauce over the rolled tortillas. Sprinkle with the remaining shredded cheese. \n6. Bake for 20-25 minutes, until the cheese is melted and bubbly. \n7. Garnish with cilantro and serve hot.",
        "rating": 4.6
      },
      {
        "id": 42,
        "recipe_name": "Sopa de Tortilla",
        "ingredients": [
          "1 onion, chopped",
          "1 clove garlic, minced",
          "1 tbsp. vegetable oil",
          "1 can (14.5 oz.) diced tomatoes",
          "4 cups chicken broth",
          "1 tsp. ground cumin",
          "1 tsp. chili powder",
          "1/4 tsp. cayenne pepper",
          "Salt and pepper to taste",
          "10 corn tortillas, cut into strips",
          "Oil for frying",
          "1 avocado, diced",
          "1/4 cup chopped fresh cilantro",
          "1/2 cup shredded Monterey Jack cheese",
          "Lime wedges for serving"
        ],
        "cooking_method": "1. In a large pot, sauté the onion and garlic in the vegetable oil until softened. \n2. Add the diced tomatoes, chicken broth, cumin, chili powder, cayenne pepper, salt, and pepper to the pot. Bring to a boil, then reduce heat and simmer for 10-15 minutes. \n3. While the soup is simmering, fry the tortilla strips in oil until crispy. Drain on paper towels. \n4. To serve, ladle the soup into bowls. Top with fried tortilla strips, diced avocado, cilantro, and shredded cheese. \n5. Serve hot with lime wedges.",
        "rating": 4.8
      },
      {
        "id": 43,
        "recipe_name": "Tostadas",
        "ingredients": [
          "1 lb. ground beef",
          "1/2 onion, chopped",
          "1 can (16 oz.) refried beans",
          "1 can (4 oz.) chopped green chilies",
          "1 tbsp. chili powder",
          "1 tsp. ground cumin",
          "1/2 tsp. salt",
          "8 tostada shells",
          "2 cups shredded lettuce",
          "1 tomato, diced",
          "1 cup shredded cheddar cheese",
          "Sour cream and salsa for serving"
        ],
        "cooking_method": "1. In a large skillet, cook the ground beef and onion over medium-high heat until browned. Drain off any excess fat. \n2. Stir in the refried beans, green chilies, chili powder, cumin, and salt. Cook for 5-10 minutes, until heated through and well combined. \n3. To assemble the tostadas, spread some of the beef mixture onto each tostada shell. Top with shredded lettuce, diced tomato, and shredded cheddar cheese. \n4. Serve with sour cream and salsa.",
        "rating": 4.3
      }
    ]
  },
  {
    "id": 5,
    "chef_picture": "https://img.freepik.com/free-photo/portrait-young-male-baker-with-his-arms-crossed-looking-camera_23-2148189025.jpg?size=626&ext=jpg&ga=GA1.1.1712736525.1683002556&semt=ais",
    "chef_name": "Maria Torres",
    "country_name": "Mexico",
    "years_of_experience": 12,
    "num_recipes": 36,
    "likes": 1200,
    "bio": "Chef Maria Torres is a talented chef with over 12 years of experience cooking delicious Mexican dishes. She is passionate about sharing her love of Mexican cuisine with others and creating meals that evoke memories and emotions.",
    "recipes": [
      {
        "id": 51,
        "recipe_name": "Pico de Gallo",
        "ingredients": [
          "4 ripe tomatoes, diced",
          "1/2 onion, chopped",
          "1/4 cup chopped fresh cilantro",
          "2 jalapeño peppers, seeded and minced",
          "2 cloves garlic, minced",
          "2 tbsp. lime juice",
          "Salt and pepper to taste"
        ],
        "cooking_method": "1. In a medium bowl, combine the tomatoes, onion, cilantro, jalapeño peppers, and garlic. \n2. Drizzle with lime juice and stir well to combine. \n3. Season with salt and pepper to taste. \n4. Refrigerate for at least 30 minutes before serving to allow the flavors to meld together.",
        "rating": 4.5
      },
      {
        "id": 52,
        "recipe_name": "Tacos al Pastor",
        "ingredients": [
          "2 lbs. pork shoulder, sliced into thin strips",
          "1 onion, sliced",
          "4 cloves garlic, minced",
          "1 can (7 oz.) chipotle peppers in adobo sauce",
          "1/2 cup pineapple juice",
          "2 tbsp. white vinegar",
          "2 tsp. dried oregano",
          "Salt and pepper to taste",
          "Corn tortillas, chopped cilantro, diced onion, and lime wedges for serving"
        ],
        "cooking_method": "1. In a blender, puree the chipotle peppers and adobo sauce until smooth. \n2. In a large bowl, combine the pork strips, onion, garlic, pureed chipotle peppers, pineapple juice, white vinegar, oregano, salt, and pepper. Stir well to coat the pork. \n3. Cover and refrigerate for at least 2 hours, or overnight. \n4. Preheat grill or grill pan to medium-high heat. \n5. Thread the marinated pork strips onto skewers. Grill for 8-10 minutes per side, until cooked through and slightly charred. \n6. Meanwhile, warm the corn tortillas on the grill or in a dry skillet. \n7. To assemble the tacos, spoon some of the grilled pork onto each warm tortilla. Top with chopped cilantro and diced onion. Serve with lime wedges.",
        "rating": 4.9
      },
      {
        "id": 53,
        "recipe_name": "Churros",
        "ingredients": [
          "1 cup water",
          "1/2 cup unsalted butter",
          "1/4 tsp. salt",
          "1 cup all-purpose flour",
          "3 eggs",
          "1/2 cup granulated sugar",
          "1 tsp. ground cinnamon",
          "Vegetable oil for frying"
        ],
        "cooking_method": "1. In a medium saucepan, combine the water, butter, and salt. Bring to a boil over medium-high heat. \n2. Reduce heat to low and add the flour all at once. Stir vigorously until the mixture forms a ball and pulls away from the sides of the pan. \n3. Remove the pan from the heat and let cool for 5 minutes. \n4. Beat in the eggs one at a time, stirring well after each addition, until the batter is smooth and shiny. \n5. In a shallow bowl, combine the sugar and cinnamon. Set aside. \n6. Heat vegetable oil in a deep skillet or pot to 375°F. \n7. Spoon the churro batter into a pastry bag fitted with a star tip. Pipe 4-6 inch lengths of dough into the hot oil, cutting them off with scissors. Fry until golden brown, turning occasionally. Drain on paper towels. \n8. Roll the warm churros in the cinnamon-sugar mixture until coated. Serve immediately.",
        "rating": 4.7
      }
    ]
  },

  {
    "id": 6,
    "chef_picture": "https://img.freepik.com/free-photo/male-chef-uniform-hat-sitting-cutting-cucumber-kitchen_176474-9026.jpg?size=626&ext=jpg&ga=GA1.1.1712736525.1683002556&semt=ais",
    "chef_name": "Juan Rodriguez",
    "country_name": "Mexico",
    "years_of_experience": 18,
    "num_recipes": 47,
    "likes": 1800,
    "bio": "Chef Juan Rodriguez is a seasoned chef with over 18 years of experience cooking delicious Mexican cuisine. His passion for cooking began when he was a child, watching his mother and grandmother prepare traditional dishes with love and care.",
    "recipes": [
      {
        "id": 61,
        "recipe_name": "Enchiladas Verdes",
        "ingredients": [
          "12 corn tortillas",
          "3 cups cooked shredded chicken",
          "1/2 onion, chopped",
          "2 cloves garlic, minced",
          "1 can (4 oz.) diced green chilies",
          "1/2 cup chopped fresh cilantro",
          "1 cup chicken broth",
          "1 cup sour cream",
          "1 cup shredded Monterey Jack cheese",
          "Salt and pepper to taste",
          "Vegetable oil for frying"
        ],
        "cooking_method": "1. In a large skillet, heat the vegetable oil over medium-high heat. \n2. Dip each corn tortilla into the hot oil for a few seconds, until softened and pliable. Drain on paper towels. \n3. Preheat oven to 350°F. \n4. In another skillet, cook the chicken, onion, and garlic over medium heat until browned. Add the green chilies, cilantro, and chicken broth. Cook for 5-10 minutes, until heated through and well combined. \n5. Remove from heat and stir in the sour cream and shredded Monterey Jack cheese. Season with salt and pepper to taste. \n6. Spoon some of the chicken mixture onto each tortilla. Roll up and place seam-side down in a greased baking dish. \n7. Bake for 15-20 minutes, until heated through and the cheese is melted and bubbly. \n8. Serve hot with your favorite toppings.",
        "rating": 4.8
      },
      {
        "id": 62,
        "recipe_name": "Guacamole",
        "ingredients": [
          "3 ripe avocados, peeled and pitted",
          "1/2 onion, chopped",
          "2 cloves garlic, minced",
          "1 jalapeño pepper, seeded and minced",
          "2 tbsp. lime juice",
          "1/4 cup chopped fresh cilantro",
          "Salt and pepper to taste"
        ],
        "cooking_method": "1. In a medium bowl, mash the avocados with a fork or potato masher until desired consistency is reached. \n2. Stir in the onion, garlic, jalapeño pepper, lime juice, and cilantro. \n3. Season with salt and pepper to taste. \n4. Refrigerate for at least 30 minutes before serving to allow the flavors to meld together.",
        "rating": 4.6
      },
      {
        "id": 63,
        "recipe_name": "Sopa de Fideo",
        "ingredients": [
          "1 lb. fideo (vermicelli pasta)",
          "2 tbsp. vegetable oil",
          "1 onion, chopped",
          "2 cloves garlic, minced",
          "1 can (14.5 oz.) diced tomatoes",
          "8 cups chicken broth",
          "1 tsp. ground cumin",
          "1/2 tsp. dried oregano",
          "Salt and pepper to taste",
          "Lime wedges, chopped cilantro, and diced avocado for serving"
        ],
        "cooking_method": "1. In a large skillet, heat the vegetable oil over medium-high heat. \n2. Add the fideo and cook, stirring frequently, until browned and toasted, about 5 minutes. \n3. Add the onion and garlic and cook for another 2-3 minutes, until softened. \n4. Add the diced tomatoes, chicken broth, cumin, oregano, salt, and pepper. Bring to a boil, then reduce heat to low and simmer for 10-15 minutes, until the pasta is tender and the soup is heated through. \n5. Serve hot with lime wedges, chopped cilantro, and diced avocado.",
        "rating": 4.5
      }
    ]
  }
]
